{"_id":{"$oid":"609ff200cda8577ce9cefd57"},"title":"Silence of the Lambs","description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal","genre":{"name":"Thriller","description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"director":{"name":"Jonathan Demme","bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","birth":"1944","death":"2017"},"imagePath":" https://www.imdb.com/title/tt0102926/mediaviewer/rm3242988544/?ref_=ext_shr_lnk","featured":true}
{"_id":{"$oid":"60a1267a59d9060f13ba4335"},"title":"The Conjuring","description":"The Conjuring is  a 2013 American supernatural horror film.  Patrick Wilson and Vera Farmiga star as Ed and Lorraine Warren, paranormal investigators and authors associated with prominent cases of haunting. The Warrens come to the assistance of the Perron family, who experienced increasingly disturbing events in their farmhouse in Rhode Island in 1971.","genre":{"name":"Horror","description":"A horror film is one that seeks to elicit fear in its audience for entertainment purposes. Horror films additionally aim to evoke viewers nightmares, revulsions and terror of the unknown or the macabre. Initially inspired by literature from authors such as Edgar Allan Poe, Bram Stoker, and Mary Shelley, horror has existed as a film genre for more than a century. Horror may also overlap with the fantasy, supernatural fiction, and thriller genres."},"director":{"name":"James Wan","bio":"James Wan is an Australian film director, screenwriter, producer, and comic book writer.","birth":"1977-02-26","death":null},"imagePath":"https://www.imdb.com/title/tt1457767/mediaviewer/rm1035247872/?ref_=ext_shr_lnk","featured":true}
{"_id":{"$oid":"60a127c959d9060f13ba4336"},"title":"Insidious","description":"The story of Insidious centers on a couple whose son inexplicably enters a comatose state and becomes a vessel for a variety of entities in an astral dimension known as ''The Further'' who want to inhabit his body.","genre":{"name":"Horror","description":"A horror film is one that seeks to elicit fear in its audience for entertainment purposes. Horror films additionally aim to evoke viewers nightmares, revulsions and terror of the unknown or the macabre. Initially inspired by literature from authors such as Edgar Allan Poe, Bram Stoker, and Mary Shelley, horror has existed as a film genre for more than a century. Horror may also overlap with the fantasy, supernatural fiction, and thriller genres."},"director":{"name":"James Wan","bio":"James Wan is an Australian film director, screenwriter, producer, and comic book writer.","birth":"1977-02-26","death":null},"imagePath":"https://www.imdb.com/title/tt1591095/mediaviewer/rm638040576/?ref_=ext_shr_lnk","featured":true}
{"_id":{"$oid":"60a1291f59d9060f13ba4337"},"title":"The Outpost","description":"The Outpost is a 2020 American film  based on the 2012 non-fiction book The Outpost: An Untold Story of American Valor by Jake Tapper, about the Battle of Kamdesh in the war in Afghanistan.","genre":{"name":"War","description":"War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama. It has been strongly associated with the 20th century. The fateful nature of battle scenes means that war films often end with them. Themes explored include combat, survival and escape, camaraderie between soldiers, sacrifice, the futility and inhumanity of battle, the effects of war on society, and the moral and human issues raised by war."},"director":{"name":"Rod Lurie","bio":"Rod Lurie is an Israeli-American director, screenwriter, and former film critic.","birth":"1962-05-15","death":null},"imagePath":"https://www.imdb.com/title/tt3833480/mediaviewer/rm464958465/?ref_=ext_shr_lnk","featured":true}
{"_id":{"$oid":"60a12a1759d9060f13ba4338"},"title":"War Horse","description":"War Horse is a 2011 American war film based on Michael Morpurgo''s 1982 novel of the same name. Set before and during World War I, it tells of the journey of Joey, a bay Thoroughbred horse raised by British teenager Albert (Irvine), as he is bought by the British Army, leading him to encounter numerous individuals and owners throughout Europe, all the while experiencing the tragedies of the war happening around him.","genre":{"name":"War","description":"War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama. It has been strongly associated with the 20th century. The fateful nature of battle scenes means that war films often end with them. Themes explored include combat, survival and escape, camaraderie between soldiers, sacrifice, the futility and inhumanity of battle, the effects of war on society, and the moral and human issues raised by war."},"director":{"name":"Steven Spielberg","bio":"Steven Allan Spielberg is an American film director, producer, and screenwriter. He began his career in the New Hollywood era, and is one of the most commercially successful directors in history. Spielberg is the recipient of various accolades, including two Academy Awards for Best Director, a Kennedy Center honor, and a Cecil B. DeMille Award.","birth":"1946-12-18","death":null},"imagePath":"https://www.imdb.com/title/tt1568911/mediaviewer/rm577879296/?ref_=ext_shr_lnk","featured":true}
{"_id":{"$oid":"60a12b3659d9060f13ba4339"},"title":"Kingdom of Heaven","description":"Kingdom of Heaven is a 2005 epic historical drama film. The story is set during the Crusades of the 12th century. A French village blacksmith goes to the aid of the Kingdom of Jerusalem in its defence against the Ayyubid Muslim Sultan, Saladin, who is fighting to claim back the city from the Christians; this leads to the Battle of Hattin. The screenplay is a heavily fictionalised portrayal of the life of Balian of Ibelin (ca. 1143–93).","genre":{"name":"Historical drama","description":"A historical drama is a work set in a past time period, usually used in the context of film and television. Historical drama includes historical fiction and romances, adventure films, and swashbucklers. A period piece may be set in a vague or general era such as the Middle Ages or a specific period such as the Roaring Twenties."},"director":{"name":"Ridley Scott","bio":"Sir Ridley Scott is an English film director and producer.","birth":"1937-11-30","death":null},"imagePath":"https://www.imdb.com/title/tt0320661/mediaviewer/rm1110749697/?ref_=ext_shr_lnk","featured":true}
{"_id":{"$oid":"60a12d4e1e0887da946444a9"},"title":"Lincoln","description":"Lincoln is a 2012 American biographical historical drama film who covers the final four months of Lincoln''s life, focusing on his efforts in January 1865 to abolish slavery and involuntary servitude by having the Thirteenth Amendment to the United States Constitution passed by the United States House of Representatives.","genre":{"name":"Historical drama","description":"A historical drama is a work set in a past time period, usually used in the context of film and television. Historical drama includes historical fiction and romances, adventure films, and swashbucklers. A period piece may be set in a vague or general era such as the Middle Ages or a specific period such as the Roaring Twenties."},"director":{"name":"Steven Spielberg","bio":"Steven Allan Spielberg is an American film director, producer, and screenwriter. He began his career in the New Hollywood era, and is one of the most commercially successful directors in history. Spielberg is the recipient of various accolades, including two Academy Awards for Best Director, a Kennedy Center honor, and a Cecil B. DeMille Award.","birth":"1946-12-18","death":null},"imagePath":"https://www.imdb.com/title/tt0443272/mediaviewer/rm291022848/?ref_=ext_shr_lnk","featured":true}
{"_id":{"$oid":"60a12e6b1e0887da946444aa"},"title":"The Whole Nine Yards","description":"The Whole Nine Yards is a 2000 American crime comedy film.  Its story follows a mild-mannered dentist as he travels to Chicago to inform a mob boss about the whereabouts of his new neighbor, a former hitman with a price on his head.","genre":{"name":"Comedy","description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"director":{"name":"Jonathan Lynn","bio":"Jonathan Lynn is an English stage and film director, producer, writer, and actor.","birth":"1943-04-03","death":null},"imagePath":"https://www.imdb.com/title/tt0190138/mediaviewer/rm2373163264/?ref_=ext_shr_lnk","featured":true}
{"_id":{"$oid":"60a130c31e0887da946444ab"},"title":"There Will Be Blood","description":"There Will Be Blood is a 2007 American epic period drama film written and directed by Paul Thomas Anderson, loosely based on the 1927 novel 'Oil' by Upton Sinclair. It stars Daniel Day-Lewis as Daniel Plainview, a silver miner-turned-oilman on a ruthless quest for wealth during Southern California's oil boom of the late 19th and early 20th centuries.","genre":{"name":"Drama","description":"In film and television, drama is a category of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"director":{"name":"Paul Thomas Anderson","bio":"Paul Thomas Anderson is an American film director, producer, and screenwriter.","birth":"1970-06-26","death":null},"imagePath":"https://www.imdb.com/title/tt0469494/mediaviewer/rm883920896/?ref_=ext_shr_lnk","featured":true}
{"_id":{"$oid":"60a133711e0887da946444ac"},"title":"Goodfellas","description":"Goodfellas it's a film adaptation of the 1985 nonfiction book Wiseguy by Pileggi. The film narrates the rise and fall of mob associate Henry Hill and his friends and family from 1955 to 1980.","genre":{"name":"Crime film","description":"Crime films, in the broadest sense, is a film genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection. Stylistically, the genre may overlap and combine with many other genres, such as drama or gangster film, but also include comedy, and, in turn, is divided into many sub-genres, such as mystery, suspense or noir."},"director":{"name":"Martin Scorsese","bio":"Martin Scorsese is an American film director, producer, screenwriter, and actor. One of the major figures of the New Hollywood era, he is widely regarded as one of the most significant and influential directors in film history.","birth":"1942-11-17","death":null},"imagePath":"https://www.imdb.com/title/tt0099685/mediaviewer/rm2091797760/?ref_=ext_shr_lnk","featured":true}
